/*
 * Реализовать фукнцию isalpha, которая проверяет, является ли переданный символ буквой (конкретно латинской буквой)
 * Реализовать функцию tolower, которая превращает заглавные латинские буквы в маленькие, а другие символы возвращает неизменными
 */

bool isalpha(unsigned char c) {
    if ((c >= 65 && c <= 90) || (c >= 97 && c <= 122)) {
        return true;
    }
    return false;
}

unsigned char tolower(unsigned char c) {
    if(c >= 65 && c <= 90) {
        c += 32;
    }
    return c;
}
